<p>Видео-разбор подвига (решение смотреть только после своей попытки): <a href="https://youtu.be/45q8BT03c_U" rel="noopener noreferrer nofollow">https://youtu.be/45q8BT03c_U</a></p>

<p><strong>Подвиг 10 (на повторение).</strong> Необходимо написать программу для представления и управления расписанием телевизионного вещания. Для этого нужно объявить класс TVProgram, объекты которого создаются командой:</p>

<pre><code>pr = TVProgram(название канала)</code></pre>

<p>где <u>название канала</u> - это строка с названием телеканала.</p>

<p>В каждом объекте класса TVProgram должен формироваться локальный атрибут:</p>

<p>items - список из телепередач (изначально список пуст).</p>

<p>В самом классе TVProgram должны быть реализованы следующие методы:</p>

<p><u>add_telecast(self, tl)</u> - добавление новой телепередачи в список items;<br>
<u>remove_telecast(self, indx)</u> - удаление телепередачи по ее порядковому номеру (атрибуту __id, см. далее).</p>

<p>Каждая телепередача должна описываться классом Telecast, объекты которого создаются командой:</p>

<pre><code>tl = Telecast(порядковый номер, название, длительность)</code></pre>

<p>где <u>порядковый номер</u> - номер телепередачи в сетке вещания (от 1 и далее); <u>название</u> - наименование телепередачи; <u>длительность</u> - время телепередачи (в секундах - целое число).</p>

<p>Соответственно, в каждом объекте класса Telecast должны формироваться локальные приватные атрибуты:</p>

<p>__id - порядковый номер (целое число);<br>
__name - наименование телепередачи (строка);<br>
__duration - длительность телепередачи в секундах (целое число).</p>

<p>Для работы с этими приватными атрибутами в классе Telecast должны быть объявлены соответствующие объекты-свойства (property):</p>

<p>uid - для записи и считывания из локального атрибута __id;<br>
name - для записи и считывания из локального атрибута __name;<br>
duration - для записи и считывания из локального атрибута __duration.</p>

<p>Пример использования классов (эти строчки в программе писать не нужно):</p>

<pre><code>pr = TVProgram("Первый канал")
pr.add_telecast(Telecast(1, "Доброе утро", 10000))
pr.add_telecast(Telecast(2, "Новости", 2000))
pr.add_telecast(Telecast(3, "Интервью с Балакиревым", 20))
for t in pr.items:
    print(f"{t.name}: {t.duration}")</code></pre>

<p>P.S. В программе требуется объявить классы с описанным функционалом. На экран в программе выводить ничего не нужно. </p><br><br><font color="gray">Memory limit: 256 MB</font><br><font color="gray">Time limit: 15 seconds</font><br><br>