<p>Видео-разбор подвига (решение смотреть только после своей попытки): <a href="https://youtu.be/oyeub94DCKw" rel="noopener noreferrer nofollow">https://youtu.be/oyeub94DCKw</a></p>

<p><strong>Подвиг 6.</strong> Вам необходимо написать программу описания музеев. Для этого нужно объявить класс Museum, объекты которого формируются командой:</p>

<pre><code>mus = Museum(название музея)</code></pre>

<p>В объектах этого класса должны формироваться следующие локальные атрибуты:</p>

<p>name - название музея (строка);<br>
exhibits - список экспонатов (изначально пустой список).</p>

<p>Сам класс Museum должен иметь методы:</p>

<p><u>add_exhibit(self, obj)</u> - добавление нового экспоната в музей (в конец списка exhibits);<br>
<u>remove_exhibit(self, obj)</u> - удаление экспоната из музея (из списка exhibits по ссылке obj - на экспонат)<br>
<u>get_info_exhibit(self, indx)</u> - получение информации об экспонате (строка) по индексу списка (нумерация с нуля).</p>

<p>Экспонаты представляются объектами своих классов. Для примера объявите в программе следующие классы экспонатов:</p>

<p><u>Picture</u> - для картин;<br>
<u>Mummies</u> - для мумий;<br>
<u>Papyri</u> - для папирусов.</p>

<p>Объекты этих классов должны создаваться следующим образом (с соответствующим набором локальных атрибутов):</p>

<pre><code>p = Picture(название, художник, описание)            # локальные атрибуты: name - название; author - художник; descr - описание
m = Mummies(имя мумии, место находки, описание)      # локальные атрибуты: name - имя мумии; location - место находки; descr - описание
pr = Papyri(название папируса, датировка, описание)  # локальные атрибуты: name - название папируса; date - датировка (строка); descr - описание</code></pre>

<p>Метод get_info_exhibit() класса Museum должен возвращать значение атрибута descr указанного экспоната в формате:</p>

<p>"Описание экспоната {name}: {descr}"</p>

<p>Например:</p>

<p>"Описание экспоната Девятый вал: Айвазовский написал супер картину."</p>

<p>Пример использования классов (в программе эти строчки писать не нужно - только для примера):</p>

<pre><code>mus = Museum("Эрмитаж")
mus.add_exhibit(Picture("Балакирев с подписчиками пишет письмо иноземному султану", "Неизвестный автор", "Вдохновляющая, устрашающая, волнующая картина"))
mus.add_exhibit(Mummies("Балакирев", "Древняя Россия", "Просветитель XXI века, удостоенный мумификации"))
p = Papyri("Ученья для, не злата ради", "Древняя Россия", "Самое древнее найденное рукописное свидетельство о языках программирования")
mus.add_exhibit(p)
for x in mus.exhibits:
    print(x.descr)</code></pre>

<p>P.S. На экран ничего выводить не нужно. </p><br><br><font color="gray">Memory limit: 256 MB</font><br><font color="gray">Time limit: 15 seconds</font><br><br>